
import { HistoryPoint, Reason } from './types'
import reasonsImage1 from '../../../assets/reasons_1.svg'
import reasonsImage2 from '../../../assets/reasons_2.svg'
import reasonsImage3 from '../../../assets/reasons_3.svg'
import reasonsImage4 from '../../../assets/reasons_4.svg'
import reasonsImage5 from '../../../assets/reasons_5.svg'
import reasonsImage6 from '../../../assets/reasons_6.svg'

export const reasons: Reason[] = [
  {
    icon: reasonsImage1,
    header: 'Качественное образование',
    text: 'Наши учебные планы полностью соответсвуют российским и европейским стандартам. Некоторые из учебных направлений уникальны для ЦЧР'
  },
  {
    icon: reasonsImage2,
    header: 'Профессии, которым мы учим',
    text: 'Наши специальности востребованы рынком. Профессия программиста сейчас находится на первом месте в рейтинге самых высокооплачиваемых профессий России.'
  },
  {
    icon: reasonsImage3,
    header: 'Люди',
    text: 'Преподаватели на ПММ — это ведущие высокопрофессиональные специалисты, 90% из них являются кандидатами и докторами наук. '
  },
  {
    icon: reasonsImage4,
    header: 'Оборудование',
    text: 'В составке факультета ПММ 10 компьютерных лабораторий. Вы будете иметь доступ к самым современным образовательным технологиям и ресурсам'
  },
  {
    icon: reasonsImage5,
    header: 'Университет',
    text: 'ВГУ — самый престижный ВУЗ региона. В ближайшей перспективе является 10-ым федеральным университетом России'
  },
  {
    icon: reasonsImage6,
    header: 'Социальные гарантии',
    text: 'Иногородним студентам предостовляются места в общежитии. Ежедгодно многим студентам выделяются путевки для отдыха.'
  }
]


export const historyPoints: HistoryPoint[] = [
  {
    year: '1959',
    header: 'Образование физического и математико-механического факультетов',
    text: 'В 1959 году на базе физико-математического факультета были созданы математико-механический и физический факультеты. В том же году в Воронеж приехал Дюис Данилович Ивлев, который в декабре 1959 года возглавил организованную им кафедру теории упругости и пластичности. Талантливый учёный, прекрасный организатор и превосходный педагог, Дюис Данилович сумел в короткий срок активизировать научную и методическую работу механиков университета. Созданная им воронежская научная школа механики быстро получила союзное, а затем и мировое признание.'
  },
  {
    year: '1961',
    header: 'Создание кафедры вычислительной математики',
    text: 'Первым специалистом в области вычислительной математики в Воронежском университете стал Борис Павлович Пугачев, который возглавлял кафедру вычислительной математики с 1969 по 1974 годы. А первым заведующим кафедрой стал профессор Селим Григорьевич Крейн, создавший вместе с М.А. Красносельским и В.И. Соболевым хорошо известную в нашей стране и за рубежом школу функционального анализа.'
  },
  {
    year: '1969',
    header: 'Создание кафедры технической кибернетики и автоматического регулирования',
    text: 'После окончания университета в 1959 году Быковцев Геннадий Иванович поступил в аспирантуру и через три года защитил кандидатскую диссертацию, в которой рассмотрел различные задачи идеально пластической анизотропии. Защита диссертации состоялась в ВГУ, оппонентами были Ю.Н. Работнов и Л.А. Толоконников.\nВ 1969 году в Московском университете он защитил докторскую диссертацию на тему «Исследование свойств уравнений статики и динамики пластически деформирующихся сред». В этом же году он организовал и возглавил кафедру технической кибернетики и автоматического регулирования'
  },
  {
    year: '1974',
    header: 'Кафедра математических методов исследования операций вошла в состав факультета ПММ',
    text: 'В начале 1942 года Наум Яковлевич Краснер окончил ускоренные курсы подготовки лейтенантов и в 1942 был отправлен на Сталинградский фронт. Впоследствии окончил Высший военный педагогический институт Красной Армии, а затем математико-механический факультет ВГУ и с 1961 года стал работать ассистентом на этом же факультете. Активно занимался научной работой, связанной с математическим моделированием в текстильной промышленности. В 1967 году защитил кандидатскую диссертацию, а в 1969 году основал кафедру математических методов исследования операций на математическом факультете. С 1971 по 1974 годы кафедра находилась в составе экономического факультета. С 1969 по 1980 год Краснер Наум Яковлевич являлся заведующим кафедрой. В 1974 году кафедра входит в состав факультета прикладной математики и механики. С 1978 года и до конца жизни являлся одним из организаторов и руководителей международной школы-семинара по системному моделированию социально-экономических процессов.'
  },
  {
    year: '1982',
    header: 'Из кафедры вычислительной математики выделилась кафедра математического обеспечения ЭВМ. На базе кафедр теории упругости и пластичности и теоретической механики и аэрогидромеханики образована кафедра теоретической и прикладной механики.',
    text: ''
  },
  {
    year: '2001',
    header: 'Факультет прикладной математики и механики переименован в факультет прикладной математики, информатики и механики (ПММ).',
    text: ''
  },
  {
    year: '2003',
    header: 'Образована кафедра программного обеспечения и администрирования информационных систем. Создана лаборатория компьютерной механики.',
    text: ''
  },
  {
    year: '2004',
    header: 'Создана  учебная лаборатория встраиваемых систем (ныне лаборатория системного программирования им. В.Е. Калечица). Создан учебный центр по подготовке специалистов для компании «SIEMENS».',
    text: 'Одиннадцатого октября 2004 г. в учебных классах, оборудованных немецкой компанией «SIEMENS», начались занятия для первых тридцати студентов. Занятия проводят лучшие преподаватели университета и специалисты компании по специально разработанной учебной программе, ориентированной на потребности компании «ATOS».'
  },
  {
    year: '2012',
    header: 'Cоздание учебного центра по подготовке специалистов для  компании «Т-Системс СиАйЭс»',
    text: ''
  },
  {
    year: '2015',
    header: 'Организация крупнейшего межрегионального открытого фестиваля РОБОАРТ и открытие центра робототехники факультета ПММ',
    text: 'Факультет ПММ выступил организатором робототехнического фестиваля РОБОАРТ - которые в последующий годы занял лидирующие позиции в РФ!\n\n14 декабря открылся центр робототехники факультета ПММ - основными целями работы Центра  являются обеспечение условий для осуществления инновационной экспериментальной деятельности обучающихся, повышение качества дополнительного образования в области робототехники для школьников, студентов, учителей и преподавателей через интеграцию педагогических и информационных технологий.'
  },
  {
    year: '2016',
    header: 'Открытие учебного центра компании AT Consulting по направлениям "Big data" и "Business analysis"',
    text: '9 сентября в Воронежском государственном университете состоялось торжественное открытие центра изучения информационных технологий, который создан совместно с компанией AT Consulting – одним из ведущих поставщиков ИТ-услуг в России и СНГ.'
  },
  {
    year: '2018',
    header: 'Открытие на факультете самой современной в регионе лаборатории по машинному обучению и анализу данных',
    text: 'При поддержке Новолипецкого металлургического комбината  была открыта уникальная лаборатория машинного обучения и анализа данных с самым современным оборудованием.'
  }
]
